import React from 'react';

const About = () => {
    return <h2>Задание:
    <p>Внедрить в проект  таблицы react-table.</p>
    <p>Добавить роли пользователей admin, user</p>
    <p>Реализовать блок администрирования для роли admin</p>
    <p>Реализовать страницу список пользователей в виде таблицы </p>
    <p>Добавить действия Удалить, Заблокировать и тд</p>
    <p>Перенести в блок администрирования блок обратной связи</p>
    <p>Добавить возможность сортировки и перетаскивания колонок</p>
    <p>* Реализовать динамическую подгрузку данных (виртуализация) при скроллировании</p>
    <p>* Для просмотра на мобильных устройствах зафиксировать первую колонку, остальные скроллировать.</p>
    <p>Разместить лабораторную работу в репозиторий в github отдельным коммитом</p>
    <p>Прикрепить  сылку на проект в виде текста</p>
    </h2>;
};

export default About;