import React from 'react';

const About = () => {
    return <h2>Задание:
    <p>Реализовать или использовать простой REST сервер</p>
    <p>Реализовать несколько (GET, POST, PUT, DELETE) запросов на сервер используя промисы JS (fetch, axios).</p>
    <p>Использовать формы (авторизации, регистрации, обратной связи) отправки данных на сервер из лабораторной работы №5.</p>
    <p>Добавить возможность редактирования профиля пользователя</p>
    <p>Вывести результаты GET запроса от сервера на экран, например, все отзывы обратной связи.</p>
    <p>Добавить возможность удаления записей обратной связи</p>
    <p>Для оптимизации использовать redux</p>
    <p>Разместить лабораторную работу в репозиторий в github отдельным коммитом</p>
    <p>Прикрепить ссылку на проект в виде текста</p>
    </h2>;
};

export default About;