import React from 'react';

const About = () => {
    return <h2>Задание:
    <p>Внедрить в проект UI Kit Mui/Bootstrap или им подобное, для возможности адаптива.</p>
    <p>Реализовать Header (Главная, О себе) - отдельные страницы.</p>
    <p>Изменение темы на темную перенести в Header.</p>
    <p>Привести профиль пользователя в стандарт библиотеки Mui/Bootstrap</p>
    <p>Реализовать Menu (Drawer/Slider) - Меню по прежнему должно открывать список лабораторных, но должно быть скрываемым и вызываться из Header по кнопке-иконке.</p>
    <p>В нижнем меню организовать вызов быстрых действий (обратная связь и пр)</p>
    <p>* Проконтролировать, что приложение стало адаптивным под разные устройства.</p>
    <p>Разместить лабораторную работу в репозиторий в github отдельным коммитом</p>
    <p>Прикрепить ссылку на проект в виде текста</p>
    </h2>;
};

export default About;