import React from 'react';

const About = () => {
    return <h2>Задание:
    <p>Создать "Hello World" приложение на основе React</p>
    <p>Для создания можно использовать create-react-app или vite</p>
    <p>Реализовать компонент кнопку, контейнер и использовать их на странице</p>
    <p>Реализовать шаблон страницы и разместить на нем компоненты навигации </p>
    <p>Разместить проект в репозиторий в github</p>
    <p>Прикрепить текстовый файл с сcылкой на проект</p>
    </h2>;
};

export default About;