import React from 'react';

const About = () => {
    return <h2>Задание:
    <p>Реализовать форму регистрации и форму авторизации с помощью React-hook-forms или Formik (валидация полей)</p>
    <p>Реализовать блок обратной связи. Форма обратной связи и список отзывов</p>
    <p>Обработать submit форм через useCallback функции по примеру Лабораторной работы 1</p>
    <p>Реализовать кастомный хук useLoginState</p>
    <p>Выдает true / false -  статус авторизации</p>
    <p>Если true - отрисовать приложение, иначе форму авторизации</p>
    <p>Хранить статус авторизации можно в redux, context или localStore</p>
    <p>Реализовать в правом верхнем углу профиль пользователя с кнопкой разлогина</p>
    <p>Разместить лабораторную работу в репозиторий в github отдельным коммитом</p>
    <p>Прикрепить ссылку в виде текста</p>
    </h2>;
};

export default About;