import React from 'react';

const About = () => {
    return <h2>Задание:
    <p>Продолжаем задание "Реализовать шаблон страницы и разместить на нем компоненты навигации" (Можно использовать готовые библиотеки Mui/Bootstrap и тд)</p>
    <p>Реализуем компоненты Header, Footer, Menu и Content</p>
    <p>В меню выводим список лабораторных работ</p>
    <p>В Content  выводим содержимое лабораторной работы </p>
    <p>Разместить проект в репозиторий в github</p>
    <p>Прикрепить текстовый файл с сылкой на проект</p>
    </h2>;
};

export default About;