import React from 'react';

const About = () => {
    return <h2>Задание:
    <p>Реализовать скрипт, который уведомит о полной загрузке страницы</p>
    <p>Реализовать кнопку счетчик, которая будет увеличивать счетчик на "1" и вывести его значение на страницу (button onclick)</p>
    <p>Реализовать кнопку счетчик, которая будет уменьшать счетчик на "1" реализовать с помощью listener click</p>
    <p>Реализовать форму аутентификации пользователя (form)</p>
    <p>Реализовать скрипт очистки данных формы</p>
    <p>Реализовать скрипт отправки данных формы с помощью listener submit.</p>
    <p>Без отправки на сервер провести валидацию введенных данных, если login=="admin" & pass=="admin" вывести сообщение об успехе, иначе сообщение о неуспехе</p>
    <p>Реализовать скрипт сохранения учетных данных и авто подстановку оных с помощью localStorage</p>
    </h2>;
};

export default About;